driver-tests/bpelse/TerminationHandler/TerminationHandlerJbi/test/HandledFaultInTH/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:iow="http://j2ee.netbeans.org/wsdl/IOWSDL5">
  <soapenv:Body>
    <iow:IOWSDL5Operation>
      <InputPart>Test8</InputPart>
    </iow:IOWSDL5Operation>
  </soapenv:Body>
</soapenv:Envelope>